<?php
/*PHP的运算符号*/
$a = 20;
$b = 16;

/** 算术运算符号 */
echo "<b style='color:red'>在其他语言中(不是在PHP中),+号除了有加法的作用,还有拼接字符的功能:</b><br>";
echo 1+1+"2+4+6"+1+1;  //PHP会取出字符串中第一个数字"2"; Result = 6;
echo "<br/>";
echo 1+1+"2e+2+4+6"+1+1;  //PHP会取出字符中的指数2e+2 = 2 x 10 x 10 进行算数运算; Result = 204;
echo "<br/><br/>";

/** % 取余数和取摸,负数也是整数 */
echo "<b style='color:red'>PHP的 %运算中是将 小数进行割舍为整数再求模:</b><br>";
echo -13%2;  //正负号与%前面这个数有关
echo "<br>";
echo 13%-2;  
echo "<br>";
echo 13.54%2.455;  //相对于JS处理是不一样的,无小数求模
echo "<br><br>";
?>
<script>
   // alert(1+1+"2+4+6"+1+1); //22+4+611 //字符后的拼接就是相连接,字符串之前可以进行运算
    console.log("JS的+号运算符号:"+1+1+"2+4+6"+1+1); //112+4+611   //于上形成对比
    console.log(13.54%2.455); //有小数求模
</script>