#include <stdio.h>
#include <string.h>

#define HEIGHT 7  // 根据下面定义，每个字母高度均是7行
const char *letters[] = {
  "\
  \########@\
  \##      @\
  \##      @\
  \######  @\
  \##      @\
  \##      @\
  \##      @\
  ", // @标志着该行结束  ,1行 11个字符
  "\
  \####@\
  \ ## @\
  \ ## @\
  \ ## @\
  \ ## @\
  \ ## @\
  \####@\
  ",
  "\
  \ ###### @\
  \##    ##@\
  \##      @\
  \ ###### @\
  \      ##@\
  \##    ##@\
  \ ###### @\
  ",
  "\
  \##     ##@\
  \##     ##@\
  \##     ##@\
  \#########@\
  \##     ##@\
  \##     ##@\
  \##     ##@\
  ",
  "\
  \ ###### @\
  \##    ##@\
  \##      @\
  \##      @\
  \##      @\
  \##    ##@\
  \ ###### @\
  "
};


int main()
{
  int i, j;
  int cunt;
  printf("请输入空格数量:");
  scanf("%d",&cunt);

#if 1
  // 一行一行打印
  for (i = 0; i < HEIGHT; i++) //7行
  {
          // 打印所有字母的某一行 五组对于五个单词（7行）
          for (j = 0; j < 5; j++)
          {
                  // k 用于迭代每一行的‘#’字符
                  int k = 0;
                  // 计算出该字母每一行有多少个字符
                  int len = strlen(letters[j]) / HEIGHT;   // letters[0]= ########@  ##      @  ##      @  ######  @  ##      @  ##      @  ##      @
                  // 计算当前打印第几行                      // len 为每一行 每一个字母的 ()最大个数)
                  int line = i * len; //用于二维数组的列数

                  // @标志着该行结束  则执行下面的
                  while (letters[j][line+k] != '@')
                  {
                          putchar(letters[j][line+k]); //进行输出字符,采用二维数组输出
                          k++;
                  }

                  // 打印字母间的间隔(空格)
                  int temp = cunt;
                  while (temp--)
                  {
                          putchar(' ');
                  }
          }
          putchar('\n');
  }
#endif
  return 0;
}
